// ============================ 导入


// ============================ 常量定义
const {ccclass, property} = cc._decorator;


// ============================ 变量定义


// ============================ 类定义
@ccclass
export default class Ads extends cc.Component {
    // LIFE-CYCLE CALLBACKS

    // onLoad () {}

    start () {

    }

    // update (dt) {}
}


// ============================ 组件定义


// ============================ 方法定义


// ============================ 导出


// ============================ 立即执行

